## 5.데이터프레임 변경

In [ ]:
# 라이브러리 불러오기
import pandas as pd

### 5.1. 데이터프레임 합치기(Concat)

- **concat()** 함수를 사용해 두 데이터프레임을 가로 또는 세로로 합칠 수 있습니다.

#### 5.1.1.가로로 합치기

- **axis=1** 옵션을 지정해 가로로 합칠 수 있습니다.
- **행 인덱스 값을 기준으로** 합칩니다!

<img src='https://raw.githubusercontent.com/Jangrae/img/master/concat_ax1.png' width=500, align="left"/>

**1) 데이터 읽어오기**

In [ ]:
# 서울 인구정보 읽어오기 #1
path = 'https://bit.ly/PopH01File'
pop01 = pd.read_csv(path, index_col='year')
pop01.index.name = None

# 확인
print(pop01.head(10))

      k_male  k_female
1981    4160      4191
1982    4160      4191
1983    4160      4191
1984    4160      4191
1985    4160      4191
1986    4899      4888
1987    5000      4979
1988    5156      5120
1989    5305      5261
1990    5321      5282

In [ ]:
# 서울 인구정보 읽어오기 #2
path = 'https://bit.ly/PopH02File'
pop02 = pd.read_csv(path, index_col='year')
pop02.index.name = None

# 확인
print(pop02.head(10))

      f_male  f_female
1985       7         6
1986       7         5
1987       6         5
1988       5         5
1989       6         5
1990       5         4
1991      18        14
1992      19        16
1993      19        17
1994      21        19

**2) 데이터프레임 합치기**

- 이제 **concat()** 함수를 사용해 두 데이터프레임을 합쳐봅니다.
- 가로로 합치므로 **axis=1** 옵션을 지정합니다.
- join='outer'는 기본 옵션값이므로 생략이 가능합니다.

In [ ]:
# 모든 헹 합치기
pop = pd.concat([pop01, pop02], join='outer', axis=1)

# 확인
print(pop.head(10))

      k_male  k_female  f_male  f_female
1981    4160      4191     NaN       NaN
1982    4160      4191     NaN       NaN
1983    4160      4191     NaN       NaN
1984    4160      4191     NaN       NaN
1985    4160      4191     7.0       6.0
1986    4899      4888     7.0       5.0
1987    5000      4979     6.0       5.0
1988    5156      5120     5.0       5.0
1989    5305      5261     6.0       5.0
1990    5321      5282     5.0       4.0

- pop02 데이터프레임에는 1981~1984년 데이터가 없어 합쳐진 결과에 결측치가 생깁니다.
- join='inner' 옵션을 지정하면 매핑되지 못한 행은 제외됩니다.

In [ ]:
# 모든 헹 합치기
pop = pd.concat([pop01, pop02], join='inner', axis=1)

# 확인
print(pop.head(10))

      k_male  k_female  f_male  f_female
1985    4160      4191       7         6
1986    4899      4888       7         5
1987    5000      4979       6         5
1988    5156      5120       5         5
1989    5305      5261       6         5
1990    5321      5282       5         4
1991    5468      5405      18        14
1992    5500      5435      19        16
1993    5478      5412      19        17
1994    5409      5351      21        19

#### 5.1.2.세로로 합치기


- **axis=0** 옵션을 지정해 세로로 합칠 수 있습니다.(기본값)
- **열 이름을 기준으로** 합칩니다!

<img src='https://raw.githubusercontent.com/Jangrae/img/master/concat_ax0.png' width=450, align="left"/>

**1) 데이터 읽어오기**

In [ ]:
# 서울 인구정보 읽어오기 #1
path = 'https://bit.ly/PopV01File'
pop01 = pd.read_csv(path)

# 확인
print(pop01.head())

   year  k_male  k_female  f_male  f_female
0  1985    4788      4838       7         6
1  1986    4899      4888       7         5
2  1987    5000      4979       6         5
3  1988    5156      5120       5         5
4  1989    5305      5261       6         5

In [ ]:
# 서울 인구정보 읽어오기 #2
path = 'https://bit.ly/PopV02File'
pop02 = pd.read_csv(path)

# 확인
print(pop02.head(10))

   year  k_male  k_female  f_male  f_female
0  2001    5142      5122      34        34
1  2002    5109      5098      36        37
2  2003    5085      5089      49        54
3  2004    5075      5098      54        61
4  2005    5062      5105      61        68
5  2006    5062      5119      83        92
6  2007    5063      5130     111       118
7  2008    5062      5139     123       132
8  2009    5059      5149     122       134
9  2010    5111      5201     125       137

**2) 데이터프레임 합치기**

- 이제 **concat()** 함수를 사용해 두 데이터프레임을 합쳐봅니다.
- 세로로 합치므로 **axis=0** 옵션을 지정하거나 생략합니다.

In [ ]:
# 모든 헹 합치기
pop = pd.concat([pop01, pop02], axis=0)

# 확인
print(pop)

    year  k_male  k_female  f_male  f_female
0   1985    4788      4838       7         6
1   1986    4899      4888       7         5
2   1987    5000      4979       6         5
3   1988    5156      5120       5         5
4   1989    5305      5261       6         5
5   1990    5321      5282       5         4
6   1991    5468      5405      18        14
7   1992    5500      5435      19        16
8   1993    5478      5412      19        17
9   1994    5409      5351      21        19
10  1995    5302      5249      24        21
11  1996    5231      5187      27        25
12  1997    5187      5150      28        25
13  1998    5147      5124      27        24
14  1999    5141      5123      30        28
15  2000    5167      5145      32        30
0   2001    5142      5122      34        34
1   2002    5109      5098      36        37
2   2003    5085      5089      49        54
3   2004    5075      5098      54        61
4   2005    5062      5105      61        68
5   2006    5062      5119      83        92
6   2007    5063      5130     111       118
7   2008    5062      5139     123       132
8   2009    5059      5149     122       134
9   2010    5111      5201     125       137

- 세로로 합해지면 인덱스 값이 중복될 수 있으므로 인덱스를 재배열합니다.

In [ ]:
# 인덱스 재배열
pop = pd.concat([pop01, pop02], axis=0, ignore_index=True)

# 확인
print(pop)

    year  k_male  k_female  f_male  f_female
0   1985    4788      4838       7         6
1   1986    4899      4888       7         5
2   1987    5000      4979       6         5
3   1988    5156      5120       5         5
4   1989    5305      5261       6         5
5   1990    5321      5282       5         4
6   1991    5468      5405      18        14
7   1992    5500      5435      19        16
8   1993    5478      5412      19        17
9   1994    5409      5351      21        19
10  1995    5302      5249      24        21
11  1996    5231      5187      27        25
12  1997    5187      5150      28        25
13  1998    5147      5124      27        24
14  1999    5141      5123      30        28
15  2000    5167      5145      32        30
16  2001    5142      5122      34        34
17  2002    5109      5098      36        37
18  2003    5085      5089      49        54
19  2004    5075      5098      54        61
20  2005    5062      5105      61        68
21  2006    5062      5119      83        92
22  2007    5063      5130     111       118
23  2008    5062      5139     123       132
24  2009    5059      5149     122       134
25  2010    5111      5201     125       137

### 5.2.데이터프레임 Merge(SQL에서의 Join!)

- **merge()** 함수를 사용, 두 데이터프레임을 **지정한 칼럼** 값을 기준으로 **가로**로(옆으로)병합할 수 있습니다.
    * **지정한 칼럼** : key 라고도 부릅니다. default는 같은 이름 칼럼입니다.
    * merge는 **가로**로 만 병합할 수 있습니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/join.png' width=600, align="left"/>

#### 5.2.1.데이터 읽어오기

In [ ]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/sales.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/products.csv")

In [ ]:
sales.head()

   OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
0      107    2  2016-01-02  p1036481    2  2100    c150417
1       69    1  2016-01-02  p1152861    1  1091    c212716
2       69    7  2016-01-02  p1013161    1  2600    c212716
3       69    8  2016-01-02  p1005771    1  1650    c212716
4       69   11  2016-01-02  p1089531    1  2600    c212716

In [ ]:
products.head()

  ProductID ProductName Category SubCategory  CategoryOrd
0  p1052661         새우깡       간식          과자            3
1  p1054261       고구마스틱       간식          과자            3
2  p1097821          짱구       간식          과자            3
3  p1097831         감자칩       간식          과자            3
4  p1119071        뿌셔뿌셔       간식          과자            3

#### 5.2.2.inner 조인

- 같은 이름의 열이 있으면 on 옵션을 지정하지 않아도 그 열을 기준으로 조인됩니다.
- 그래도 기준 열을 명시적으로 지정해 주기를 권고합니다.
- how='inner' 옵션은 기본 옵션값이므로 생략할 수 있습니다.

In [ ]:
# 공통된 칼럼이 있으면 그 칼럼을 key로 사용
pd.merge(sales, products).head()

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,ProductName,Category,SubCategory,CategoryOrd
0,107,2,2016-01-02,p1036481,2,2100,c150417,순두부,반찬류,두부,1
1,137,4,2016-01-02,p1036481,2,2100,c280590,순두부,반찬류,두부,1
2,63,16,2016-01-03,p1036481,1,1050,c037915,순두부,반찬류,두부,1
3,135,3,2016-01-04,p1036481,3,3150,c100815,순두부,반찬류,두부,1
4,63,13,2016-01-06,p1036481,10,10500,c048405,순두부,반찬류,두부,1

In [ ]:
# 공통된 칼럼을 key로 사용
data = pd.merge(sales, products, on='ProductID')
data.head()

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,ProductName,Category,SubCategory,CategoryOrd
0,107,2,2016-01-02,p1036481,2,2100,c150417,순두부,반찬류,두부,1
1,137,4,2016-01-02,p1036481,2,2100,c280590,순두부,반찬류,두부,1
2,63,16,2016-01-03,p1036481,1,1050,c037915,순두부,반찬류,두부,1
3,135,3,2016-01-04,p1036481,3,3150,c100815,순두부,반찬류,두부,1
4,63,13,2016-01-06,p1036481,10,10500,c048405,순두부,반찬류,두부,1

In [ ]:
# 조인
idata = pd.merge(sales, products, on='ProductID', how='inner')
idata.head()

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,ProductName,Category,SubCategory,CategoryOrd
0,107,2,2016-01-02,p1036481,2,2100,c150417,순두부,반찬류,두부,1
1,137,4,2016-01-02,p1036481,2,2100,c280590,순두부,반찬류,두부,1
2,63,16,2016-01-03,p1036481,1,1050,c037915,순두부,반찬류,두부,1
3,135,3,2016-01-04,p1036481,3,3150,c100815,순두부,반찬류,두부,1
4,63,13,2016-01-06,p1036481,10,10500,c048405,순두부,반찬류,두부,1

#### 5.2.3.outer 조인

- how='outer' 옵션을 지정합니다.

In [ ]:
# 조인
odata = pd.merge(sales, products, on='ProductID',  how='outer')

# 확인
odata.head()

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,ProductName,Category,SubCategory,CategoryOrd
0,107,2,2016-01-02,p1036481,2,2100,c150417,순두부,반찬류,두부,1
1,137,4,2016-01-02,p1036481,2,2100,c280590,순두부,반찬류,두부,1
2,63,16,2016-01-03,p1036481,1,1050,c037915,순두부,반찬류,두부,1
3,135,3,2016-01-04,p1036481,3,3150,c100815,순두부,반찬류,두부,1
4,63,13,2016-01-06,p1036481,10,10500,c048405,순두부,반찬류,두부,1

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

### 결합1) Join(Merge) + groupby

[문1]  조인Join(Merge)

sales와 products를 ProductID 기준으로 merge하여 새로운 데이터프레임 data로 저장하고 내용을 확인합니다.

In [ ]:
data = pd.merge(sales, products, on='ProductID')
data.head()

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,ProductName,Category,SubCategory,CategoryOrd
0,107,2,2016-01-02,p1036481,2,2100,c150417,순두부,반찬류,두부,1
1,137,4,2016-01-02,p1036481,2,2100,c280590,순두부,반찬류,두부,1
2,63,16,2016-01-03,p1036481,1,1050,c037915,순두부,반찬류,두부,1
3,135,3,2016-01-04,p1036481,3,3150,c100815,순두부,반찬류,두부,1
4,63,13,2016-01-06,p1036481,10,10500,c048405,순두부,반찬류,두부,1

[문2] Category별 총 매출액(Amt) 조회

In [ ]:
data.groupby(by='Category', as_index=False)['Amt'].sum()

  Category       Amt
0       간식  12920570
1       과일  49789339
2      반찬류  32204820
3      유제품  45261956
4       채소  54822783

[문3] Category별 총 매출액(Qty) 조회

In [ ]:
data.groupby(by='Category', as_index=False)['Qty'].sum()

  Category    Qty
0       간식  12130
1       과일   6786
2      반찬류  20210
3      유제품  19731
4       채소  27859

[문4] 내림차순으로 가장 매출이 높은 상품명 10개 조회

In [ ]:
# 방법 1)
data.groupby(by='ProductName', as_index=False)['Amt'].sum().sort_values(by='Amt', ascending=False).head(10)

   ProductName       Amt
37      우유1000  18129067
23        사과_소  14078818
9         딸기_대  11011541
7         두부_대  10119037
10        딸기_소   7517664
8         두부_소   7319963
49         콩나물   6971347
39       유기농우유   6437323
50         토마토   6291001
43          참외   5491030

In [ ]:
# 방법 2)
data2 = data.groupby(by='ProductName', as_index=False)['Amt'].sum()
data2.sort_values(by='Amt', ascending=False).head(10)

   ProductName       Amt
37      우유1000  18129067
23        사과_소  14078818
9         딸기_대  11011541
7         두부_대  10119037
10        딸기_소   7517664
8         두부_소   7319963
49         콩나물   6971347
39       유기농우유   6437323
50         토마토   6291001
43          참외   5491030

### 결합2: 붙이기 concat

[문1] 결합1의 문2의 결과를 dataframe con1으로 저장하고 내용을 확인하시오.

In [ ]:
con1 = data.groupby(by='Category', as_index=False)['Amt'].sum()
con1.head()

  Category       Amt
0       간식  12920570
1       과일  49789339
2      반찬류  32204820
3      유제품  45261956
4       채소  54822783

[문2] 결합1의 문3 결과 데이터 중에서 세 개 head(3)를 con2로 저장하고 내용을 확인하시오.

In [ ]:
con2 = data.groupby(by='Category', as_index=False)['Qty'].sum().head(3)
con2.head()

  Category    Qty
0       간식  12130
1       과일   6786
2      반찬류  20210

[문3] 두 데이터프레임을 가로(열)로 붙이기 axis = 1

In [ ]:
# 가로(열)로 붙이기 axis = 1, 방법- outer
pd.concat([con1, con2], axis=1, join='outer')

  Category       Amt Category      Qty
0       간식  12920570       간식  12130.0
1       과일  49789339       과일   6786.0
2      반찬류  32204820      반찬류  20210.0
3      유제품  45261956      NaN      NaN
4       채소  54822783      NaN      NaN

In [ ]:
# 가로(열)로 붙이기 axis = 1, 방법- inner
pd.concat([con1, con2], axis=1, join='inner')

  Category       Amt Category    Qty
0       간식  12920570       간식  12130
1       과일  49789339       과일   6786
2      반찬류  32204820      반찬류  20210

[문4] 두 데이터프레임 세로(행)으로 붙이기 axis = 0

In [ ]:
# 세로(행)으로 붙이기 axis = 0, 방법- outer
pd.concat([con1, con2], axis=0, join='outer')

  Category         Amt      Qty
0       간식  12920570.0      NaN
1       과일  49789339.0      NaN
2      반찬류  32204820.0      NaN
3      유제품  45261956.0      NaN
4       채소  54822783.0      NaN
0       간식         NaN  12130.0
1       과일         NaN   6786.0
2      반찬류         NaN  20210.0

In [ ]:
# 세로(행)으로 붙이기 axis = 0, 방법- inner
pd.concat([con1, con2], axis=0, join='inner')

  Category
0       간식
1       과일
2      반찬류
3      유제품
4       채소
0       간식
1       과일
2      반찬류